/**
 * TODO:
 * - Создайте функцию `Character` принимающую параметр `name`.
 * - В функции присвойте `this` свойство `name` со значением параметра `name`
 * и свойство `hp` со значением 100. 
 */

// ???



/**
 * TODO: Создать два экземпляра `Character` - robert и richard.
 */

// ???



/**
 * TODO: Отнять у Роберта 25 очков здоровья
 */

// ???



/**
 * TODO: Добавить в прототип `Character` свойство `inventory`, которое будет массивом.
 */

// ???



/**
 * TODO: Добавить предмет в инвентароь Ричарда
 */

// ???



module.exports = {
    Character,
    robert,
    richard
};