/**
 * TODO:
 * - Создать объект `character` с помощью `Object.create`.
 * - В качестве прототипа указать `Object.prototype`.
 * - При создании объекта определить свойства `name: 'Benedict'` и `hp: 100`,
 * используя второй аргумент `Object.create`.
 */

// ???



/**
 * TODO:
 * - Создать объект `warrior` с помощью `Object.create`.
 * - В качестве прототипа указать `character`.
 * - При создании, объекту определить свойство `weapon` со значением `Sword`,
 * используя второй аргумент `Object.create`.
 */

// ???



/**
 * TODO:
 * - Создать объект `knight` с помощью `Object.create`.
 * - В качестве прототипа указать `warrior`.
 * - При создании, объекту определить свойство `mp` со значением 100,
 * используя второй аргумент `Object.create`.
 */

// ???



module.exports = {
    character,
    warrior,
    knight
}