/**
 * TODO:
 * Создать функцию `Character`, которая создает
 * объект со свойствами `name: string` и `hp: number`.
 */

// ???



/**
 * TODO:
 * Прототипу `Character` добавить метод `greet`,
 * который будет выводить в консоль строку приветствия 'Приветствую!'
 */

// ???



/**
 * TODO:
 * Создать функцию `Warrior`, которая создает
 * объект со свойствами `name: string`, `hp: number`,
 * `weapon: string` и `stamine: number`.
 */

// ???



/**
 * TODO:
 * - Связать прототип `Warrior` с прототипом `Character`.
 * - Конструктором прототипа `Warrior` сделать функцию `Warrior`.
 */

// ???



/**
 * TODO:
 * Прототипу `Warrior` добавить метод `attack`, который:
 * - принимает в качестве аргумента персонажа,
 * - снимает ему здоровье (случайное число от 1 до 10),
 * - отнимает 10 едениц стамины,
 * - возвращает нанесенный урон
 */

// ???



/**
 * TODO:
 * Создать функцию `Knight`, которая создает
 * объект со свойствами `name: string`, `hp: number`,
 * `weapon: string`, `stamina: number` и `mp: number`.
 */

// ???



/**
 * TODO:
 * - Связать прототип `Knight` с прототипом `Warrior`.
 * - Конструктором прототипа `Knight` сделать функцию `Knight`.
 */

// ???



/**
 * TODO:
 * Прототипу `Knight` добавить метод `heal`, который:
 * - принимает в качестве аргумента персонажа,
 * - восстанавливать ему здоровье (случайное число от 1 до 10),
 * - отнимать 10 едениц маны
 * - возвращает нанесенный урон
 */

// ???



module.exports = {
    Character,
    Warrior,
    Knight
};